name: "PaviaU"
layer {
  name: "data2"
  type: "HDF5Data"
  top: "data_ave"
  top: "label"
  hdf5_data_param{
    source: "./train.txt"
    batch_size:1600
  }
  include {phase: TRAIN}
}
layer {
  name: "data2"
  type: "HDF5Data"
  top: "data_ave"
  top: "label"
  hdf5_data_param{
    source: "./test.txt"
    batch_size:6904
  }
  include {phase: TEST}
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data_ave"
  top: "conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 20
    #pad: 2
    kernel_w:11
    kernel_h:1
    stride: 1

    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }

  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: AVE
    kernel_w: 3
    kernel_h: 1
    stride: 3
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "pool1"
  top: "pool1"
}
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "pool1"
  top: "ip1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 100

    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "ip1"
  top: "ip1"
}
layer {
  name: "dropout"
  type: "Dropout"
  bottom: "ip1"
  top: "ip1"
  dropout_param{
    dropout_ratio:0.5
  }
}

layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 8

    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }

  }
}


layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "ip2"
  bottom: "label"
  top: "accuracy"
  include {
    #phase: TEST
  }
}

layer {
  name:"loss"
  type:"SoftmaxWithLoss"
  bottom:"ip2"
  bottom:"label"
  top: "loss"
  include{
    phase: TRAIN
  }
}

layer {
  name: "hdf5out"
  type: "HDF5Output"
  bottom: "ip2"
  bottom: "label"
  hdf5_output_param{
    file_name: "outputLabel.h5"
  }
  include{
    phase: TEST
  }
}
